app/controllers/coordinators_controller.rb

SELECT  `coordinators`.* FROM `coordinators` WHERE `coordinators`.`id` = 0 LIMIT 1
---
    def set_coordinator
      @coordinator = Coordinator.find(params[:id])