app/controllers/students_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 0 LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])